src/Documents/ТранспортнаяЛогистика/ТранспортнаяЛогистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранспортнаяЛогистика</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаЗаказы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Маршруты/Маршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Маршруты</name>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокДвижения</name>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67fc19c3-1b39-455a-a36d-977ccc7986e6">
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fac2f68b-89ca-4292-ac3f-e6803b093aec">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="56ba8e3c-152e-472e-978c-1c8a27110815">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="62afa2d4-135f-44b9-aeb8-d536b15d0b0f">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d5825e6-3ce4-45b1-b381-4ca2c180c292">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5f2d0eed-be8d-428e-b069-3c1f0e091139">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ed3160d7-bf41-4fa7-b0c0-314e4b913418">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="822dc11f-971f-42ce-bea9-d73bd3da4fba">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="66f390f7-3e60-482a-aeb1-c99f1f343346">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="45d2eecb-2dd4-4f02-9eec-3b4f3eae095f">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1a44c1d6-4cdc-42bb-8de5-d50750ac626d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ТранспортнаяЛогистика/Forms/ФормаПереносаВДругойМаршрутРейс/Module.bsl
&НаКлиенте
Процедура Перенести(Команда)
	
	Если Элементы.МаршрутыРейсы.ТекущиеДанные.ПолучитьРодителя() = Неопределено И
		Элементы.МаршрутыРейсы.ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 тогда
		Возврат;
	КонецЕсли;
	
	Если МаршрутИсточник = Элементы.МаршрутыРейсы.ТекущиеДанные.Маршрут тогда
		
		ТекстСообщения = "";
		Если РейсИсточник = Элементы.МаршрутыРейсы.ТекущиеДанные.Рейс тогда
			ТекстСообщения = "Не имеет смысла переносить точки рейса маршрута в тоже маршрут и рейс!";
		КонецЕсли;
		
		Если Элементы.МаршрутыРейсы.ТекущиеДанные.Рейс > РейсИсточник тогда
			ТекстСообщения = "Нельзя переносить точки рейса маршрута, в больший рейс этого же маршрута!";
		КонецЕсли;
		
		Если ВыделеныВсеСтрокиРейса И Элементы.МаршрутыРейсы.ТекущиеДанные.Рейс > РейсИсточник тогда
			Если Элементы.МаршрутыРейсы.ТекущиеДанные.Маршрут = МаршрутИсточник тогда
				ТекстСообщения = "Нельзя переносить все точки рейса маршрута, в больший рейс того же маршрута!";
			КонецЕсли;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстСообщения) тогда
			ПоказатьПредупреждение(
				Новый ОписаниеОповещения(),
				ТекстСообщения
			);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("СамовывозИсточник", СамовывозИсточник);
	ПараметрыЗакрытия.Вставить("ВыделенныеСтроки" , ВходящиеПараметры.ВыделенныеСтроки);
	ПараметрыЗакрытия.Вставить("МаршрутИсточник"  , МаршрутИсточник);
	ПараметрыЗакрытия.Вставить("РейсИсточник"     , РейсИсточник);
	ПараметрыЗакрытия.Вставить("Маршрут"          , Элементы.МаршрутыРейсы.ТекущиеДанные.Маршрут);
	ПараметрыЗакрытия.Вставить("Рейс"             , Элементы.МаршрутыРейсы.ТекущиеДанные.Рейс);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрокаМаршрута из Параметры.Маршруты цикл
		НоваяСтрокаМаршрута = Маршруты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаМаршрута, СтрокаМаршрута);
		Если ЗначениеЗаполнено(НоваяСтрокаМаршрута.Водитель) тогда
			НоваяСтрокаМаршрута.Перевозчик = НоваяСтрокаМаршрута.Водитель.Перевозчик;
		Иначе
			Если ЗначениеЗаполнено(НоваяСтрокаМаршрута.Автомобиль) тогда
				НоваяСтрокаМаршрута.Перевозчик = НоваяСтрокаМаршрута.Автомобиль.Перевозчик;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутИсточник        = Параметры.МаршрутИсточник;
	РейсИсточник           = Параметры.РейсИсточник;
	ВыделеныВсеСтрокиРейса = Параметры.ВыделеныВсеСтрокиРейса;
	
	Если ЗначениеЗаполнено(МаршрутИсточник) тогда
		СамовывозИсточник = МаршрутИсточник.Самовывоз;
	Иначе
		СамовывозИсточник = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр(
		"ТаблицаМаршруты",
		Маршруты.Выгрузить()
	);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Маршрут КАК Справочник.Маршруты) КАК Маршрут,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Самовывоз КАК БУЛЕВО) КАК Самовывоз,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Водитель КАК Справочник.Водители) КАК Водитель,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Автомобиль КАК Справочник.Автомобили) КАК Автомобиль,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Перевозчик КАК Справочник.Контрагенты) КАК Перевозчик,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Наценка КАК ЧИСЛО(15, 2)) КАК Наценка,
	|	ВЫРАЗИТЬ(ТаблицаМаршруты.Тоннаж КАК ЧИСЛО(10, 3)) КАК Тоннаж
	|ПОМЕСТИТЬ ТаблицаМаршруты
	|ИЗ
	|	&ТаблицаМаршруты КАК ТаблицаМаршруты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаМаршруты.НомерСтроки, 99999) КАК НомерМаршрута,
	|	ЕСТЬNULL(ТаблицаМаршруты.Маршрут, Маршруты.Ссылка) КАК Маршрут,
	|	ВЫБОР
	|		КОГДА ТаблицаМаршруты.Маршрут = ЗНАЧЕНИЕ(Справочник.Маршруты.ПустаяСсылка)
	|			ТОГДА ""НЕ РАСПРЕДЕЛЕНО""
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаМаршруты.Маршрут, Маршруты.Ссылка) КАК Справочник.Маршруты).Наименование
	|	КОНЕЦ КАК Представление,
	|	ЕСТЬNULL(ТаблицаМаршруты.Самовывоз, Маршруты.Самовывоз) КАК Самовывоз,
	|	ЕСТЬNULL(ТаблицаМаршруты.Водитель, ЗНАЧЕНИЕ(Справочник.Водители.ПустаяСсылка)) КАК Водитель,
	|	ЕСТЬNULL(ТаблицаМаршруты.Автомобиль, ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)) КАК Автомобиль,
	|	ЕСТЬNULL(ТаблицаМаршруты.Перевозчик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Перевозчик,
	|	СУММА(ЕСТЬNULL(ТаблицаМаршруты.Тоннаж, 0)) КАК Тоннаж,
	|	СУММА(ЕСТЬNULL(ТаблицаМаршруты.Наценка, 0)) КАК Наценка
	|ИЗ
	|	ТаблицаМаршруты КАК ТаблицаМаршруты
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Маршруты КАК Маршруты
	|		ПО ТаблицаМаршруты.Маршрут = Маршруты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТаблицаМаршруты.Маршрут, Маршруты.Ссылка),
	|	ВЫБОР
	|		КОГДА ТаблицаМаршруты.Маршрут = ЗНАЧЕНИЕ(Справочник.Маршруты.ПустаяСсылка)
	|			ТОГДА ""НЕ РАСПРЕДЕЛЕНО""
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаМаршруты.Маршрут, Маршруты.Ссылка) КАК Справочник.Маршруты).Наименование
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТаблицаМаршруты.Водитель, ЗНАЧЕНИЕ(Справочник.Водители.ПустаяСсылка)),
	|	ЕСТЬNULL(ТаблицаМаршруты.Автомобиль, ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)),
	|	ЕСТЬNULL(ТаблицаМаршруты.Перевозчик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ЕСТЬNULL(ТаблицаМаршруты.Самовывоз, Маршруты.Самовывоз),
	|	ЕСТЬNULL(ТаблицаМаршруты.НомерСтроки, 99999)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерМаршрута,
	|	Представление";
	
	ВыборкаМаршрутов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаМаршрутов.Следующий() цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаМаршрутов.Маршрут) тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаМаршрута = МаршрутыРейсы.ПолучитьЭлементы().Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаМаршрута, ВыборкаМаршрутов);
		
		Если НЕ ВыборкаМаршрутов.Самовывоз тогда
			
			ПоследнийНомерРейса = 0;
			
			Для Каждого ДанныеРейса из Параметры.Рейсы цикл
				
				Если НЕ ДанныеРейса.Маршрут = ВыборкаМаршрутов.Маршрут тогда
					Продолжить;
				КонецЕсли;
				
				ДобавитьРейсВМаршрутыРейсы(НоваяСтрокаМаршрута,
				                           ДанныеРейса.Рейс,
				                           ДанныеРейса.Тоннаж,
				                           ДанныеРейса.Наценка);
				
				ПоследнийНомерРейса = ПоследнийНомерРейса + 1;
			КонецЦикла;
			
			Если ПоследнийНомерРейса > 0 тогда
				ДобавитьРейсВМаршрутыРейсы(НоваяСтрокаМаршрута, ПоследнийНомерРейса + 1, 0, 0);
			КонецЕсли;
		Иначе
			НоваяСтрокаМаршрута.Рейс = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("ВыделенныеСтроки", Параметры.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(МаршрутИсточник) И ЗначениеЗаполнено(РейсИсточник) тогда
		УстановитьТекущуюСтрокуМаршрутыРейсы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРейсВМаршрутыРейсы(СтрокаМаршрута, НомерРейса, Тоннаж, Наценка)
	
	НоваяСтрокаРейса = СтрокаМаршрута.ПолучитьЭлементы().Добавить();
	НоваяСтрокаРейса.Маршрут = СтрокаМаршрута.Маршрут;
	НоваяСтрокаРейса.Водитель = СтрокаМаршрута.Водитель;
	НоваяСтрокаРейса.Автомобиль = СтрокаМаршрута.Автомобиль;
	НоваяСтрокаРейса.Рейс = НомерРейса;
	НоваяСтрокаРейса.Представление = "Рейс №" + Строка(НомерРейса);
	НоваяСтрокаРейса.Тоннаж = Тоннаж;
	НоваяСтрокаРейса.Наценка = Наценка;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыРейсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Перенести(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуМаршрутыРейсы()
	
	ТекущаяСтрокаУстановлена = Ложь;
	
	Для Каждого СтрокаМаршрут из МаршрутыРейсы.ПолучитьЭлементы() цикл
		
		Если СтрокаМаршрут.Маршрут = МаршрутИсточник тогда
			
			Если НЕ СтрокаМаршрут.Самовывоз тогда
				Для Каждого СтрокаРейс из СтрокаМаршрут.ПолучитьЭлементы() цикл
					
					Если СтрокаРейс.Рейс = РейсИсточник тогда
						
						Элементы.МаршрутыРейсы.ТекущаяСтрока = СтрокаРейс.ПолучитьИдентификатор();
						ТекущаяСтрокаУстановлена = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
			Иначе
				Элементы.МаршрутыРейсы.ТекущаяСтрока = СтрокаМаршрут.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекущаяСтрокаУстановлена тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура МаршрутыРейсыПриАктивизацииСтрокиНаСервере()
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("Водитель");
	ИменаПолей.Добавить("Автомобиль");
	
	ДанныеТекущейСтроки = МаршрутыРейсы.НайтиПоИдентификатору(Элементы.МаршрутыРейсы.ТекущаяСтрока);
	
	Для Каждого ИмяПоля из ИменаПолей цикл
		
		ПолеПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеТекущейСтроки.Маршрут, ИмяПоля);
		
		Если ЗначениеЗаполнено(ДанныеТекущейСтроки[ИмяПоля]) тогда
			ЭтаФорма[ИмяПоля] = ДанныеТекущейСтроки[ИмяПоля];
		Иначе
			НайденыеСтроки = Документы.ТранспортнаяЛогистика.НайтиВТаблицеМаршрутыВодителяИлиАвтомобиль(ЭтаФорма, ИмяПоля, ПолеПоУмолчанию);
			Если НайденыеСтроки.Количество() > 0 тогда
				ЭтаФорма[ИмяПоля] = Неопределено;
			Иначе
				ЭтаФорма[ИмяПоля] = ПолеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеМаршрутыРейсыПриАктивизацииСтроки()
	
	Если НЕ Элементы.МаршрутыРейсы.ТекущиеДанные.Самовывоз тогда
		
		Элементы.Водитель.Видимость = Истина;
		Элементы.Автомобиль.Видимость = Истина;
		Элементы.Перевозчик.Видимость = Истина;
		
		МаршрутыРейсыПриАктивизацииСтрокиНаСервере();
		
	Иначе
		
		Элементы.Водитель.Видимость = Ложь;
		Элементы.Автомобиль.Видимость = Ложь;
		Элементы.Перевозчик.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыРейсыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.МаршрутыРейсы.ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОтложенноеМаршрутыРейсыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры
